Revit 2016 API
TextNode.IsForRightToLeftReading Property
 Indicates whether the text uses Right-To-Left reading order.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public bool IsForRightToLeftReading { get; }
Visual Basic
Public ReadOnly Property IsForRightToLeftReading As Boolean
	Get
Visual C++
public:
property bool IsForRightToLeftReading {
	bool get ();
}
See Also
TextNode Class
Autodesk.Revit.DB Namespace